/*
 * @Description: 
 * @Version: 2.0
 * @Autor: 王敏
 * @Date: 2021-06-28 17:35:57
 * @LastEditors: 王敏
 * @LastEditTime: 2021-06-29 20:08:26
 */
let d_markers=[
  {
    id:1,
    name:'印象城',
    coor:[120.049675,30.247286],
    detail:'海底捞入驻啦，吼吼~',
    style: 0 ,
  },
  {
    id:2,
    name:'乐天城',
    coor:[120.038872,30.244869],
    detail:'这边有老婆大人哦~',
    style: 1 ,
  },
  {
    id:3,
    name:'华立云立方',
    coor:[120.029155,30.240715],
    detail:'我们公司就在这儿~',
    style: 2 ,
  },
];
let d_markers2=[
  {
    id:1,
    name:'西溪医院',
    coor:[120.044752,30.236576],
    detail:'我是西溪医院',
  },
  {
    id:2,
    name:'西溪花城',
    coor:[120.035171,30.2533],
    detail:'我是西溪花城',
  },
  {
    id:3,
    name:'宏丰公寓',
    coor:[120.031586,30.238268],
    detail:'我是宏丰公寓',
  },
];
let d_markers3=[
  {
    id:1,
    name:'印象城',
    lnglat:[120.049675,30.247286],
    detail:'海底捞入驻啦，吼吼~',
    style: 0 ,
  },
  {
    id:2,
    name:'乐天城',
    lnglat:[120.038872,30.244869],
    detail:'这边有老婆大人哦~',
    style: 1 ,
  },
  {
    id:3,
    name:'华立云立方',
    lnglat:[120.029155,30.240715],
    detail:'我们公司就在这儿~',
    style: 2 ,
  },
]
let d_line1=[
  {
    name:'线1',
    path:[
      [120.031129,30.243662],
      [120.043532,30.246369],
      [120.042974,30.252263],
    ],
  },
  {
    name:'线2',
    path:[
      [120.032932,30.240919],
      [120.031687,30.247815],
      [120.029756,30.250892],
    ],
  },
]
let d_polygons1=[
  {
    name:'西溪玫瑰',
    center:[120.041,30.250113],
    color:'red',
    path:[
      [120.039626,30.251744],
      [120.042158,30.251893],
      [120.042459,30.248556],
      [120.040442,30.248037]
    ],
  },
  {
    name:'华立181社区南区',
    center:[120.027567,30.241475],
    color:'blue',
    path:[
      [120.024477,30.242624],
      [120.030357,30.243106],
      [120.030442,30.240659],
      [120.02525,30.239658],
    ],
  },
]
export {
  d_markers,
  d_markers2,
  d_markers3,
  d_line1,
  d_polygons1,
} 